{
  "2025-10-31": [
    "Woke but a bit mad still. Spanish. Work. English. ",
    "Met with Lauren to eat, she was feeling the effects of the night before because she was krunk, being out of pocket, and behind the dj. I tried to calm.",
    "She also saw Carlos, which she texted before and definitely affected my tummy. It made me want to be there even more, but I knew that wasn’t best for me.",  
    "Got over it. I was in a good mood on the way back. Last class, had a project with Evan. Super chill.",  
    "Then I had my first date! Was feeling nervous because I was scared it would be meaningless and mid. I also didn’t know what he looked like really and I didn’t love my WhatsApp pic of him. Got ready for a while though, felt good. Hot.",  
    "Met him at Jarucha which was cool and authentic. Felt awkward at first but the conversation flowed easily. One beer felt good, a buzz. Really enjoyed my time with him, getting to know him. It was good chats.",  
    "I think he was not that attractive to me sadly. Also didn’t have any edge which I think I need— didn’t provoke me to say anything out of pocket, new, or interesting. Just a nice, normal dude. Not for me. And I got too drunk and out of pocket by the end. Saying goodbye really cemented the lack of attraction to me.",  
    "Went back to dorm, was going out with Marshall and Quimper but Marshall went to Club Malasaña and Quimper wanted to go with the AdPhi guys. I also wanted to go with the AdPhi guys for the rush of seeing Carlos.",  
    "Napped. Tried getting Marshall and sister invited, went out. Completely forgot about Marshall in the rush of it all which I still feel bad about. All I can do is not do it again and feel this feeling of guilt.",  
    "Anyways, met Quimper at Espit Chupitos. Carlos in doorway. Ignore his fucking ass! Say hi to others.",  
    "Blake says 'male model' to me and then said Campbell showed him Phratmail. I made a joke about them talking shit and he took it really personally.",  
    "Teddy was telling Quimp & I we were his fav girl friend group, he hates the other group. Quimp and I felt super uncomfortable and out of place. It was funny even in the moment though.",  
    "People left and we get in a car with Teddy. Lit vibes. In line with the SNu guys, also good chats.",  
    "Also at Chupitos the tension between Carlos and I was suffocating I think for us both. In line I saw him flirting with a random bitch, take out cigs (degen) and he had a mustache… 3/3.",  
    "Got in, took shots and Red Bull. Carlos was lurky when we were around the table then Quimp and I propelled ourselves into our own choreographed dance world. It was so much motherfucking fun. Time flow. Carlos validation was pulsing. He was staring no joke. On way back from the bathroom, I said ‘awkward’ to him and he laughed and lit up a bit.",  
    "Went back around 4. Good night. Rubicon.",  
    "Wrote this when going to bed: 'Emotional night so I want to edit. I am confused missing Carlos with us meant to be (which he probably makes every girl think). I feel bad for all the attention I didn’t give him (only said one word) but I’m seriously strong for that shit. I will wake up and be happy. Good night. Quimper funny.'",  
    "Ha—my take now is that there is a tension/connection from what is wrapped up in our history between us. It will always be there. Means nothing about us now or our future. He made me miserable!"
  ]
}